specters312/SVD_DUMP/Atmel/ATSAM4LC8A.svd
        <register>
          <name>VERSION</name>
          <description>Version Register</description>
          <addressOffset>0xFC</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000120</resetValue>
          <fields>
            <field>
              <name>VERSION</name>
              <description>Version Number</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>VARIANT</name>
              <description>Variant Number</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>BSCIF</name>
      <version>1.0.0</version>
      <description>Backup System Control Interface</description>
      <groupName>BSCIF</groupName>
      <prependToName>BSCIF_</prependToName>
      <baseAddress>0x400F0400</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>BSCIF</name>
        <value>38</value>
      </interrupt>
      <registers>
        <register>
          <name>BGCR</name>
          <description>Bandgap Calibration Register</description>
          <addressOffset>0x05C</addressOffset>
          <size>32</size>
        </register>
        <register>
          <name>BGCTRL</name>
          <description>Bandgap Control Register</description>
          <addressOffset>0x060</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ADCISEL</name>
              <description>ADC Input Selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>ADCISELSelect</name>
                <enumeratedValue>
                  <name>DIS</name>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VTEMP</name>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VREF</name>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TSEN</name>
              <description>Temperature Sensor Enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BGREFIFBVERSION</name>
          <description>BGREFIFB Version Register</description>
          <addressOffset>0x3E8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000110</resetValue>
          <fields>
            <field>
              <name>VERSION</name>
              <description>Version Number</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>VARIANT</name>
              <description>Variant Number</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BGSR</name>
          <description>Bandgap Status Register</description>
          <addressOffset>0x064</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>BGBUFRDY</name>
              <description>Bandgap Buffer Ready</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <name>BGBUFRDYSelect</name>
                <enumeratedValue>
                  <name>FLASH</name>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PLL</name>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VREG</name>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BUFRR</name>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC</name>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LCD</name>
                  <value>0x20</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BGRDY</name>
              <description>Bandgap Voltage Reference Ready</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LPBGRDY</name>
              <description>Low Power Bandgap Voltage Reference Ready</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>VREF</name>
              <description>Voltage Reference Used by the System</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BODIFCVERSION</name>
          <description>BODIFC Version Register</description>
          <addressOffset>0x3F0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000110</resetValue>
          <fields>
            <field>
              <name>VERSION</name>
              <description>Version Number</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
            <field>
              <name>VARIANT</name>
              <description>Variant Number</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BOD18CTRL</name>
          <description>BOD18 Control Register</description>
          <addressOffset>0x038</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>EN</name>
              <description>Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HYST</name>
              <description>BOD Hysteresis</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ACTION</name>
              <description>Action</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>MODE</name>
              <description>Operation modes</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FCD</name>
              <description>BOD Fuse Calibration Done</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SFV</name>
              <description>BOD Control Register Store Final Value</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BOD18LEVEL</name>
          <description>BOD18 Level Register</description>
          <addressOffset>0x03C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>VAL</name>
              <description>BOD Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>RANGE</name>
              <description>BOD Threshold Range</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BOD33CTRL</name>
          <description>BOD33 Control Register</description>
          <addressOffset>0x02C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>EN</name>
              <description>Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HYST</name>
              <description>BOD Hysteresis</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ACTION</name>
              <description>Action</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>MODE</name>
              <description>Operation modes</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FCD</name>
              <description>BOD Fuse Calibration Done</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SFV</name>
              <description>BOD Control Register Store Final Value</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BOD33LEVEL</name>
          <description>BOD33 Level Register</description>
          <addressOffset>0x030</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>VAL</name>
              <description>BOD Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BOD33SAMPLING</name>
          <description>BOD33 Sampling Control Register</description>
          <addressOffset>0x034</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CEN</name>
              <description>Clock Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CSSEL</name>
              <description>Clock Source Select</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PSEL</name>
              <description>Prescaler Select</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>BR%s</name>
          <description>Backup Register</description>
          <addressOffset>0x078</addressOffset>
          <size>32</size>
        </register>
        <register>
          <name>BRIFBVERSION</name>
          <description>Backup Register Interface Version Register</description>
          <addressOffset>0x3E4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000100</resetValue>
          <fields>
            <field>
              <name>VERSION</name>
              <description>Version Number</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
            <field>
              <name>VARIANT</name>
              <description>Variant Number</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CSCR</name>
          <description>Chip Specific Configuration Register</description>
          <addressOffset>0x01C</addressOffset>
          <size>32</size>
        </register>
        <register>
          <name>ICR</name>
          <description>Interrupt Clear Register</description>
          <addressOffset>0x010</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>OSC32RDY</name>
              <description>32kHz Oscillator Ready</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>RC32KRDY</name>
              <description>32kHz RC Oscillator Ready</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>RC32KLOCK</name>
              <description>32kHz RC Oscillator Lock</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>RC32KREFE</name>
              <description>32kHz RC Oscillator Reference Error</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>RC32KSAT</name>
              <description>32kHz RC Oscillator Saturation</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>BOD33DET</name>
              <description>BOD33 Detected</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>BOD18DET</name>
              <description>BOD18 Detected</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>BOD33SYNRDY</name>
              <description>BOD33 Synchronization Ready</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>BOD18SYNRDY</name>
              <description>BOD18 Synchronization Ready</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SSWRDY</name>
              <description>VREG Stop Switching Ready</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>VREGOK</name>
              <description>Main VREG OK</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LPBGRDY</name>
              <description>Low Power Bandgap Voltage Reference Ready</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>AE</name>
              <description>Access Error</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IDR</name>
          <description>Interrupt Disable Register</description>
          <addressOffset>0x004</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>OSC32RDY</name>
              <description>32kHz Oscillator Ready</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>RC32KRDY</name>
              <description>32kHz RC Oscillator Ready</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>RC32KLOCK</name>
              <description>32kHz RC Oscillator Lock</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>RC32KREFE</name>
              <description>32kHz RC Oscillator Reference Error</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>RC32KSAT</name>
              <description>32kHz RC Oscillator Saturation</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>BOD33DET</name>
              <description>BOD33 Detected</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>BOD18DET</name>
              <description>BOD18 Detected</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>BOD33SYNRDY</name>
              <description>BOD33 Synchronization Ready</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>BOD18SYNRDY</name>
              <description>BOD18 Synchronization Ready</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SSWRDY</name>
              <description>VREG Stop Switching Ready</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>VREGOK</name>
              <description>Mai n VREG OK</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LPBGRDY</name>
              <description>Low Power Bandgap Voltage Reference Ready</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>AE</name>
              <description>Access Error</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IER</name>
          <description>Interrupt Enable Register</description>
          <addressOffset>0x000</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>OSC32RDY</name>
              <description>32kHz Oscillator Ready</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>RC32KRDY</name>
              <description>32kHz RC Oscillator Ready</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>RC32KLOCK</name>
              <description>32kHz RC Oscillator Lock</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>RC32KREFE</name>
              <description>32kHz RC Oscillator Reference Error</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>RC32KSAT</name>
              <description>32kHz RC Oscillator Saturation</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>BOD33DET</name>
              <description>BOD33 Detected</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>BOD18DET</name>
              <description>BOD18 Detected</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>BOD33SYNRDY</name>
              <description>BOD33 Synchronization Ready</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>BOD18SYNRDY</name>
              <description>BOD18 Synchronization Ready</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SSWRDY</name>
              <description>VREG Stop Switching Ready</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>VREGOK</name>
              <description>Main VREG OK</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>LPBGRDY</name>
              <description>Low Power Bandgap Voltage Reference Ready</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>AE</name>
              <description>Access Error</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
